---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomExtensionStyle
source: html/29762e20-790a-ee2f-c26f-3e6b4de0c45d.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomExtensionStyle Property

The extension style of the rail termination at the beginning or bottom.

## Syntax (C#)
```csharp
public RailExtensionStyle StartOrBottomExtensionStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration